
# Ex10 Перевод арифметического выражения из инфиксной в постфиксную запись

## Краткие сведения из теории

### Понятие арифметического выражения

Арифметическое выражение - выражение, в котором операндами являются объекты, над которыми выполняются арифметические операции. Например,

```
(1 + 2) / (3 + 4 * 6.7) - 5.3 * 4.4
```

При такой форме записи (называемой **инфиксной**, где знаки операций стоят между операндами) порядок действий определяется расстановкой скобок и приоритетом операций. **Постфиксная** (или обратная польская) форма записи не содержит скобок, а знаки операций следуют после соответствующих операндов. Тогда для приведённого примера постфиксная форма будет иметь вид:

```
1 2 + 3 4 6.7 * + / 5.3 4.4 * -
```

Обратная польская нотация была разработана австралийским ученым Чарльзом Хэмблином в середине 50-х годов прошлого столетия на основе польской нотации, которая была предложена в 1920 году польским математиком Яном Лукасевичем. Эта нотация лежит в основе организации вычислений для арифметических выражений. Известный ученый Эдсгер Дейкстра предложил алгоритм для перевода выражений из инфиксной в постфиксную форму. Данный алгоритм основан на использовании стека.

### Перевод в постфиксную форму

Данный алгоритм основан на использовании стека. На вход алгоритма поступает строка символов, на выходе должна быть получена строка с постфиксной формой. Каждой операции и скобкам приписывается приоритет:

```
(  - 0
)  - 1
+- - 2
*/ - 3
```

Предполагается, что входная строка содержит синтаксически правильное выражение.

Входная строка просматривается посимвольно слева направо до достижения конца строки. Операндами будем считать любую последовательность символов входной строки, не совпадающую со знаками определённых в таблице операций. Операнды по мере их появления переписываются в выходную строку. При появлении во входной строке операции, происходит вычисление приоритета данной операции. Знак данной операции помещается в стек, если:

- Приоритет операции равен 0 (это '(' ),
- Приоритет операции строго больше приоритета операции, лежащей на вершине стека,
- Стек пуст.

В противном случае из стека извлекаются все знаки операций с приоритетом больше или равным приоритету текущей операции. Они переписываются в выходную строку, после чего знак текущей операции помещается в стек. Имеется особенность в обработке закрывающей скобки. Появление закрывающей скобки во входной строке приводит к выталкиванию и записи в выходную строку всех знаков операций до появления открывающей скобки. Открывающая скобка из стека выталкивается, но в выходную строку не записывается. Таким образом, ни открывающая, ни закрывающая скобки в выходную строку не попадают. После просмотра всей входной строки происходит последовательное извлечение всех элементов стека с одновременной записью знаков операций, извлекаемых из стека, в выходную строку.



### Задача №1

> Разработать функцию **infix2prefix**, преобразующую запись арифметического выражения в инфиксной форме в запись того же выражения, но в постфиксной форме 

*Примечание*

Функцию можно использовать следующим образом:

```cpp
#include "postfix.h"

int main()
{
    std::string s1("2 + 6 * 3 / (4 - 2)");
    std::string s2=infix2prefix(s1);
    std::cout << s2;  // 2 6 3 * 4 2 - / +
}
```

*Примечание*

Предполагается, что в записи арифметического выражения используются только цифры, знаки операций, скобки и десятичная точка. Числа записаны только положительные, они могут быть как целые, так и вещественные. Скобки расставлены корректно. Глубина вложения скобок - не более 100. Количество операций в выражении - не более 200.

### Задача №2

> Написать демонстрационную программу с использованием преобразования


